rails-app/app/controllers/podcasts_controller.rb

SELECT "podcasts".* FROM "podcasts" ORDER BY created_at DESC
---
  def index
    @podcasts = Podcast.all.order("created_at DESC")

INSERT INTO "podcasts" ("title", "podcastor", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "this american life"], ["podcastor", "ira glass maybe"], ["created_at", "2018-02-10 22:02:08.755971"], ["updated_at", "2018-02-10 22:02:08.755971"]]
---
  def create
    @podcast = current_user.podcasts.build(podcast_params)

    if @podcast.save

UPDATE "podcasts" SET "title" = ?, "updated_at" = ? WHERE "podcasts"."id" = ?  [["title", "this american life!!!"], ["updated_at", "2018-02-10 22:19:59.808246"], ["id", 1]]
---
  def update
    if @podcast.update(podcast_params)

DELETE FROM "podcasts" WHERE "podcasts"."id" = ?  [["id", 1]]
---
  def destroy
    @podcast.destroy

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_book
      @podcast = Podcast.find(params[:id])