rails-app/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "podcast_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 1], ["comment", "awful"], ["created_at", "2018-02-11 00:52:34.850801"], ["updated_at", "2018-02-11 00:52:34.850801"], ["user_id", 2], ["podcast_id", 5]]
---
def create
  @review = Review.new(review_params)
  @review.podcast_id = @podcast.id
  @review.user_id = current_user.id

  if @review.save

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def find_podcast
    @podcast = Podcast.find(params[:podcast_id])